Revit 2024 API
AlignmentStationLabel.Create Method
 Creates an AlignmentStationLabel object along with its underlying SpotDimension element. Returns null if element creation fails.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public static AlignmentStationLabel Create(
	Alignment alignment,
	View view,
	AlignmentStationLabelOptions options
)
Visual Basic
Public Shared Function Create ( _
	alignment As Alignment, _
	view As View, _
	options As AlignmentStationLabelOptions _
) As AlignmentStationLabel
Visual C++
public:
static AlignmentStationLabel^ Create(
	Alignment^ alignment,
	View^ view,
	AlignmentStationLabelOptions^ options
)
Parameters
alignment
Type: Autodesk.Revit.DB.Infrastructure.Alignment
The alignment on which the alignment station label is placed.
view
Type: Autodesk.Revit.DB.View
The view for which the alignment station label is created.
options
Type: Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions
The alignment station options of the label to be created.
See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace